set sdc_version 2.1

###############################################################################
# Clock
###############################################################################
create_clock [get_ports clock] -name CLOCK -period 1.000

# From PLL uncertainty
set_clock_uncertainty 0.017 [get_clocks CLOCK]

###############################################################################
# Reset
###############################################################################
set_max_delay 1 -from reset_n

###############################################################################
# Inputs
###############################################################################
# Driving cell is minimum sized inverter
set_driving_cell -lib_cell INVX1_HVT -library saed32hvt_ss0p95v125c [all_inputs]

###############################################################################
# Outputs
###############################################################################
# from "load_of [get_lib_pins saed32hvt_ss0p95v125c/DFFARX2_HVT/D]"
set_load 0.5 [all_outputs]

###############################################################################
# Area
###############################################################################
set_max_area 0.0
